#include <iostream>
#include <string>
using namespace std;

int main()
{
    // 1
    /*int a, b;
    cin >> a; cin >> b;

    cout << a + b << endl;*/

    // 2
    /*int n, k, m;
    cin >> n; cin >> k; cin >> m;

    n--;
    int pod = n / (k * m);
    int et = (n - pod * k * m) / m + 1;
    cout << (pod + 1) << " " << (et);*/

    // 3
    /*float a, b;
    int x, y;
    cin >> a; cin >> x; cin >> b; cin >> y;
    cout << floor((a * x + b * y) / (a + b));*/

    // 4
    /*int m;
    int n = 2;
    cin >> m;
    while (true) {
        if (n * (n - 1) == 2*m) {
            cout << n << endl;
            break;
        }
        else n++;
    }*/
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
